example/constant/constantProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
T0                  T0                  [0  0  0  1  0  0  0]    0;  //单位为摄氏度
rho0_f              rho0_f              [1 -3  0  0  0  0  0]  999;  //0摄氏度时水的密度
alpha_f             alpha_f             [0  0  0 -1  0  0  0] 1e-3;  //1e-5;//水的热膨胀系数，用于近似更新水的密度
beta_f              beta_f              [-1 1  2  0  0  0  0] 3e-10; //水的压缩系数，暂时不用
mu_f                mu_f 		        [1 -1 -1  0  0  0  0] 1e-05; //水的动力学黏度
DT                  DT                  [1  1 -3 -1  0  0  0]   4e3; //1e-2;//类似一个扩散系数，与湍流模型有关，这里取一个常数
cp_f                cp_f                [0  2 -2 -1  0  0  0] 4000;  //水的比热

// ************************************************************************* //
